NordicSemiconductor/nRF5-SDK-for-Mesh/mesh/friend/src/friend.c
/* Copyright (c) 2010 - 2019, Nordic Semiconductor ASA
 * All rights reserved.
 *
 * Redistribution and use in source and binary forms, with or without modification,
 * are permitted provided that the following conditions are met:
 *
 * 1. Redistributions of source code must retain the above copyright notice, this
 * list of conditions and the following disclaimer.
 *
 * 2. Redistributions in binary form, except as embedded into a Nordic
 *    Semiconductor ASA integrated circuit in a product or a software update for
 *    such product, must reproduce the above copyright notice, this list of
 *    conditions and the following disclaimer in the documentation and/or other
 *    materials provided with the distribution.
 *
 * 3. Neither the name of Nordic Semiconductor ASA nor the names of its
 *    contributors may be used to endorse or promote products derived from this
 *    software without specific prior written permission.
 *
 * 4. This software, with or without modification, must only be used with a
 *    Nordic Semiconductor ASA integrated circuit.
 *
 * 5. Any software provided in binary form under this license must not be reverse
 *    engineered, decompiled, modified and/or disassembled.
 *
 * THIS SOFTWARE IS PROVIDED BY NORDIC SEMICONDUCTOR ASA "AS IS" AND ANY EXPRESS
 * OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE IMPLIED WARRANTIES
 * OF MERCHANTABILITY, NONINFRINGEMENT, AND FITNESS FOR A PARTICULAR PURPOSE ARE
 * DISCLAIMED. IN NO EVENT SHALL NORDIC SEMICONDUCTOR ASA OR CONTRIBUTORS BE
 * LIABLE FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR
 * CONSEQUENTIAL DAMAGES (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE
 * GOODS OR SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS INTERRUPTION)
 * HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT
 * LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY OUT
 * OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF SUCH DAMAGE.
 */

#include "mesh_friend.h"
#include "nrf_mesh_config_core.h"

#if MESH_FEATURE_FRIEND_ENABLED
#include "nrf_error.h"
#include "nrf_mesh.h"
#include "nrf_mesh_events.h"
#include "event.h"
#include "nrf_mesh_externs.h"
#include "nrf_mesh_utils.h"
#include "nrf_mesh_assert.h"
#include "mesh_opt_friend.h"
#include "mesh_config_entry.h"
#include "net_state.h"
#include "internal_event.h"

/* For range defines. */
#include "mesh_lpn.h"

#include "friend_queue.h"
#include "friend_sublist.h"
#include "timer_scheduler.h"
#include "core_tx_friend.h"
#include "log.h"

NRF_MESH_STATIC_ASSERT((NRF_MESH_FRIEND_TOKEN_END - NRF_MESH_FRIEND_TOKEN_BEGIN)
                       >= MESH_FRIEND_FRIENDSHIP_COUNT);

#define FRIEND_OFFER_TIMEOUT_MS 1000
#define FRIEND_CLEAR_INITIAL_TIMEOUT_MS 1000
#define FRIEND_POLL_TIMEOUT_MAX_US (UINT32_MAX / 2)
#define FRIEND_RECENT_LPNS_LIST_COUNT (MESH_FRIEND_FRIENDSHIP_COUNT + 1)

#define FACTOR_MULTIPLY(factor, value) ((factor * 0.5 + 1) * value)

#define FRIEND_QUEUE_IS_EMPTY     0
#define FRIEND_QUEUE_IS_NOT_EMPTY 1

/*****************************************************************************
 * Local typedefs
 *****************************************************************************/

typedef enum
{
    FRIEND_STATE_IDLE,          /**< Ready for new friends. */
    FRIEND_STATE_OFFERING,      /**< Friend Offer sent -- waiting for reply. */
    FRIEND_STATE_ESTABLISHED    /**< In an established friendship. */
} friend_state_t;

/**
 * Friend parameter structure.
 */
typedef struct
{
    mesh_friendship_t friendship;     /**< Friendship parameters. */
    friend_state_t state;             /**< Friend state. */
    uint8_t fsn;                      /**< Friend Sequence Number. */
    friend_queue_t queue;             /**< Friend queue.  */
    friend_sublist_t sublist;         /**< Subscription list of the LPN. */
    timer_event_t poll_timeout;       /**< Poll timeout timer. */
    timer_event_t clear_repeat_timer; /**< Friend clear repeat timer. */
    uint8_t clear_repeat_count;       /**< Number of times to send the friend clear message. */
    core_tx_friend_t bearer;          /**< Bearer instance. */
} friendship_t;

typedef struct
{
    uint16_t last_lpn;                /**< Address of the recently seen LPN. */
    uint16_t last_req_count;          /**< Value of the LPN counter received in the friend request. */
    nrf_mesh_tx_token_t token;        /**< Bearer TX token. */
    timer_event_t confirm_send_timer; /**< Respond to valid Friend clear message in this period. */
} recent_lpns_t;

typedef struct
{
    bool enabled;
    uint8_t default_receive_window_ms;
    uint16_t friend_counter;
    nrf_mesh_evt_handler_t mesh_evt_handler;
    friendship_t friends[MESH_FRIEND_FRIENDSHIP_COUNT];
    recent_lpns_t recent_lpns[FRIEND_RECENT_LPNS_LIST_COUNT];
#if FRIEND_TEST_HOOK
    uint16_t tx_delay_ms;
#endif
} friend_t;

/*****************************************************************************
* Static globals
*****************************************************************************/
static friend_t m_friend;

/*****************************************************************************
 * Mesh config wrappers
 *****************************************************************************/

static uint32_t friend_setter(mesh_config_entry_id_t entry_id, const void * p_entry)
{
    NRF_MESH_ASSERT_DEBUG(MESH_OPT_FRND_ID_START == entry_id.record);

    const bool enable = *((const bool *) p_entry);

    if (enable && !m_friend.enabled)
    {
        m_friend.enabled = true;
    }
    else if (!enable && m_friend.enabled)
    {
        m_friend.enabled = false;
    }

    return NRF_SUCCESS;
}

static void friend_getter(mesh_config_entry_id_t entry_id, void * p_entry)
{
    NRF_MESH_ASSERT_DEBUG(MESH_OPT_FRND_ID_START == entry_id.record);

    bool * p_enabled = p_entry;
    *p_enabled = m_friend.enabled;
}

static void friend_deleter(mesh_config_entry_id_t entry_id)
{
    NRF_MESH_ASSERT_DEBUG(MESH_OPT_FRND_ID_START == entry_id.record);

