NordicSemiconductor/nRF5-SDK-for-Mesh/mesh/friend/src/friend.c
    if (m_friend.enabled)
    {
        bool enable = false;
        (void) friend_setter(entry_id, &enable);
    }
}

MESH_CONFIG_ENTRY(mesh_opt_friend,
                  MESH_OPT_FRIEND_EID,
                  1,
                  sizeof(bool),
                  friend_setter,
                  friend_getter,
                  friend_deleter,
                  true);

/* Utility functions */

/* Find entry matching with given LPN address */
static uint32_t confirm_timer_entry_find(uint16_t lpn_addr)
{
    uint32_t i;

    for (i = 0; i < FRIEND_RECENT_LPNS_LIST_COUNT; i++)
    {
        if (m_friend.recent_lpns[i].last_lpn == lpn_addr)
        {
            break;
        }
    }

    return i;
}

/* Find empty entry, and if not found, then nearest expiring entry. */
static uint32_t confirm_timer_entry_get(void)
{
    uint32_t i;
    timestamp_t nearest_expiry = timer_now();
    uint32_t nearest_expiry_idx = FRIEND_RECENT_LPNS_LIST_COUNT;
    for (i = 0; i < FRIEND_RECENT_LPNS_LIST_COUNT; i++)
    {
        if (m_friend.recent_lpns[i].last_lpn == NRF_MESH_ADDR_UNASSIGNED)
        {
            break;
        }
        else if ((i == 0) ||
                 !(TIMER_OLDER_THAN(nearest_expiry, m_friend.recent_lpns[i].confirm_send_timer.timestamp)))
        {
            nearest_expiry = m_friend.recent_lpns[i].confirm_send_timer.timestamp;
            nearest_expiry_idx = i;
        }
    }

    if (i == FRIEND_RECENT_LPNS_LIST_COUNT)
    {
        i = nearest_expiry_idx;
    }

    return i;
}

static void confirm_timer_add(uint16_t lpn_addr, uint32_t poll_timeout_ms, uint32_t req_count)
{
    uint32_t entry;

    /* Find entry to store LPN parameters. If entry already exist, replace existing entry,
     * otherwise, find suitable entry to be filled (either empty or nearest expiring) */
    entry = confirm_timer_entry_find(lpn_addr);
    if (entry == FRIEND_RECENT_LPNS_LIST_COUNT)
    {
        entry = confirm_timer_entry_get();
    }

    __LOG(LOG_SRC_FRIEND, LOG_LEVEL_DBG1, "Adding recently seen LPN: LPN 0x%04x  PT %d  entry %d\n",
          lpn_addr, poll_timeout_ms, entry);
    m_friend.recent_lpns[entry].last_lpn = lpn_addr;
    m_friend.recent_lpns[entry].last_req_count = req_count;
    timer_sch_reschedule(&m_friend.recent_lpns[entry].confirm_send_timer,
                         timer_now() + MS_TO_US(poll_timeout_ms));

}

static void confirm_timer_clear(uint16_t lpn_addr)
{
    __LOG(LOG_SRC_FRIEND, LOG_LEVEL_DBG1, "Clearing recently seen LPN: LPN 0x%04x\n", lpn_addr);
    for(uint32_t i = 0; i < FRIEND_RECENT_LPNS_LIST_COUNT; i++)
    {
        if (m_friend.recent_lpns[i].last_lpn == lpn_addr)
        {
            __LOG(LOG_SRC_FRIEND, LOG_LEVEL_DBG1, "Cleared\n");
            m_friend.recent_lpns[i].last_lpn = NRF_MESH_ADDR_UNASSIGNED;
            timer_sch_abort(&m_friend.recent_lpns[i].confirm_send_timer);
        }
    }
}

static timestamp_t remaining_poll_timeout_time_get(const friendship_t * p_friendship)
{
    const timestamp_t time_now = timer_now();
    return (/* MS_TO_US(p_friendship->friendship.poll_timeout_ms) - */
            TIMER_DIFF(p_friendship->poll_timeout.timestamp, time_now));
}

static bool friend_address_is_known(const friendship_t * p_friendship,
                                    nrf_mesh_address_t dst)
{
    if (dst.type == NRF_MESH_ADDRESS_TYPE_UNICAST)
    {
        return IS_IN_RANGE(dst.value,
                           p_friendship->friendship.lpn.src,
                           (p_friendship->friendship.lpn.src +
                            p_friendship->friendship.lpn.element_count - 1));
    }
    else
    {
        return (NRF_SUCCESS ==
                friend_sublist_contains(&p_friendship->sublist, dst.value));
    }
}

static void friend_tx(friendship_t * p_friendship,
                      transport_control_opcode_t opcode,
                      const packet_mesh_trs_control_packet_t * p_pdu,
                      uint32_t length,
                      const nrf_mesh_network_secmat_t * p_net_secmat,
                      timestamp_t tx_time)
{
    uint16_t local_address;
    uint16_t local_address_count;
    nrf_mesh_unicast_address_get(&local_address, &local_address_count);

    transport_control_packet_t control_packet;
    memset(&control_packet, 0, sizeof(control_packet));
    control_packet.opcode = opcode;
    control_packet.p_data = p_pdu;
    control_packet.data_len = length;
    control_packet.src = local_address;
    control_packet.dst.type = NRF_MESH_ADDRESS_TYPE_UNICAST;
    control_packet.dst.value = p_friendship->friendship.lpn.src;
    control_packet.p_net_secmat = p_net_secmat;
    control_packet.ttl = 0;
    control_packet.bearer_selector = CORE_TX_BEARER_TYPE_FRIEND;
    uint32_t status = transport_control_tx(&control_packet,
                                           p_friendship->bearer.token);

#if FRIEND_TEST_HOOK
    tx_time += MS_TO_US(m_friend.tx_delay_ms);
#endif

    if (status != NRF_SUCCESS)
    {
        __LOG(LOG_SRC_FRIEND, LOG_LEVEL_WARN, "TX failed: status: %d\n", status);
    }

    if (status == NRF_SUCCESS)
    {
        __LOG(LOG_SRC_FRIEND, LOG_LEVEL_DBG1, "Friend TX: opcode:%u nid:0x%02x dst:0x%04x tx_time:%u \n", control_packet.opcode, control_packet.p_net_secmat->nid, control_packet.dst.value, tx_time);
        __LOG_XB(LOG_SRC_FRIEND, LOG_LEVEL_DBG1, "Friend TX", (const uint8_t *) control_packet.p_data, control_packet.data_len);
        core_tx_friend_schedule(&p_friendship->bearer, tx_time);
    }
}

static void friendship_state_reset(friendship_t * p_friendship)
{
    memset(&p_friendship->friendship, 0, sizeof(mesh_friendship_t));
    p_friendship->state = FRIEND_STATE_IDLE;
    core_tx_friend_disable(&p_friendship->bearer);
    friend_queue_clear(&p_friendship->queue);
    friend_sublist_clear(&p_friendship->sublist);
    timer_sch_abort(&p_friendship->poll_timeout);
}

static void friendship_terminate(friendship_t * p_friendship,
                                 nrf_mesh_evt_friendship_terminated_reason_t reason)
{
    NRF_MESH_ASSERT_DEBUG(p_friendship->state != FRIEND_STATE_IDLE);

    nrf_mesh_evt_t evt;
    uint16_t dummy_element_count;
    nrf_mesh_unicast_address_get(&evt.params.friendship_terminated.friend_src,
                                 &dummy_element_count);

    evt.type = NRF_MESH_EVT_FRIENDSHIP_TERMINATED;
    evt.params.friendship_terminated.role = NRF_MESH_FRIENDSHIP_ROLE_FRIEND;
    evt.params.friendship_terminated.lpn_src = p_friendship->friendship.lpn.src;
    evt.params.friendship_terminated.reason = reason;

    confirm_timer_add(p_friendship->friendship.lpn.src, p_friendship->friendship.poll_timeout_ms,
                      p_friendship->friendship.lpn.request_count);
    friendship_state_reset(p_friendship);
    event_handle(&evt);

    __LOG(LOG_SRC_FRIEND, LOG_LEVEL_DBG1, "Friendship terminated reason %u\n", reason);
}

static bool friendship_is_active(const friendship_t * p_friendship)
{
    return (p_friendship->state != FRIEND_STATE_IDLE);
}

static uint32_t sublist_address_count_get(const transport_control_packet_t * p_packet)
{
    /* PDU format: [ transaction_number | addr1, ... , addrN         ].
     *             | byte 0             | 1  2 | ... | size-2 size-1 |
     */
    return (p_packet->data_len - 1) / 2;
}

static timestamp_t friend_offer_delay_get(mesh_friendship_receive_window_factor_t receive_window_factor,
                                          mesh_friendship_rssi_factor_t rssi_factor,
                                          uint16_t receive_window_ms,
                                          int8_t rssi)
{
    int delay = (int)(FACTOR_MULTIPLY(receive_window_factor, receive_window_ms) -
                      FACTOR_MULTIPLY(rssi_factor, rssi));

