NordicSemiconductor/nRF5-SDK-for-Mesh/mesh/friend/src/friend.c
    p_master_secmat = nrf_mesh_net_master_secmat_get(p_friendship_secmat);
    NRF_MESH_ASSERT_DEBUG(p_master_secmat != NULL);

    transport_control_packet_t control_packet;
    memset(&control_packet, 0, sizeof(control_packet));
    control_packet.opcode = TRANSPORT_CONTROL_OPCODE_FRIEND_CLEAR;
    control_packet.p_data = &friend_clear;
    control_packet.data_len = PACKET_MESH_TRS_CONTROL_FRIEND_CLEAR_SIZE;
    control_packet.src = local_address;
    control_packet.dst.type = NRF_MESH_ADDRESS_TYPE_UNICAST;
    control_packet.dst.value = p_friendship->friendship.lpn.prev_friend_src;
    control_packet.p_net_secmat = p_master_secmat;
    control_packet.ttl = NRF_MESH_TTL_MAX;
    control_packet.bearer_selector = CORE_TX_BEARER_TYPE_ADV;
    uint32_t status = transport_control_tx(&control_packet,
                                           p_friendship->bearer.token);
    NRF_MESH_ASSERT_DEBUG(status == NRF_SUCCESS ||
                          status == NRF_ERROR_FORBIDDEN ||
                          status == NRF_ERROR_NO_MEM);
}

static void friend_clear_confirm_tx(uint16_t lpn_src, uint16_t lpn_req_count,
                                    nrf_mesh_tx_token_t bearer_token,
                                    const transport_control_packet_t * p_clear_packet)
{
    packet_mesh_trs_control_packet_t friend_clear_confirm;
    memset(&friend_clear_confirm, 0, sizeof(friend_clear_confirm));
    packet_mesh_trs_control_friend_clear_confirm_lpn_address_set(
        &friend_clear_confirm, lpn_src);
    packet_mesh_trs_control_friend_clear_confirm_lpn_counter_set(
        &friend_clear_confirm, lpn_req_count);

    transport_control_packet_t control_packet;
    memset(&control_packet, 0, sizeof(control_packet));
    control_packet.opcode = TRANSPORT_CONTROL_OPCODE_FRIEND_CLEAR_CONFIRM;
    control_packet.p_data = &friend_clear_confirm;
    control_packet.data_len = PACKET_MESH_TRS_CONTROL_FRIEND_CLEAR_CONFIRM_SIZE;
    control_packet.src = p_clear_packet->dst.value;
    control_packet.dst.type = NRF_MESH_ADDRESS_TYPE_UNICAST;
    control_packet.dst.value = p_clear_packet->src;
    control_packet.p_net_secmat = p_clear_packet->p_net_secmat;
    control_packet.ttl = p_clear_packet->ttl == 0 ? 0 : NRF_MESH_TTL_MAX;
    control_packet.bearer_selector = CORE_TX_BEARER_TYPE_ALLOW_ALL;
    uint32_t status = transport_control_tx(&control_packet,
                                           bearer_token);
    NRF_MESH_ASSERT_DEBUG(status == NRF_SUCCESS ||
                          status == NRF_ERROR_FORBIDDEN);
}

static void poll_timeout_cb(timestamp_t timeout, void * p_context)
{
    NRF_MESH_ASSERT_DEBUG(p_context != NULL);
    friendship_t * p_friendship = p_context;

    friendship_terminate(p_friendship,
                         NRF_MESH_EVT_FRIENDSHIP_TERMINATED_REASON_TIMEOUT);
}

static void friend_clear_timeout_cb(timestamp_t timeout, void * p_context)
{
    friendship_t * p_friendship = p_context;
    if (p_friendship->clear_repeat_count > 0)
    {
        friend_clear_tx(p_friendship);
        friend_clear_interval_update(p_friendship);
    }
    else
    {
        timer_sch_abort(&p_friendship->clear_repeat_timer);
    }
}

static void confirm_send_timer_cb(timestamp_t timeout, void * p_context)
{
    recent_lpns_t * p_recent_lpns = p_context;
    __LOG(LOG_SRC_FRIEND, LOG_LEVEL_DBG1, "Removing last seen LPN: 0x%04x\n", p_recent_lpns->last_lpn);

    p_recent_lpns->last_lpn = NRF_MESH_ADDR_UNASSIGNED;
    timer_sch_abort(&p_recent_lpns->confirm_send_timer);
}

static recent_lpns_t * recent_lpns_get(const transport_control_packet_t * p_control_packet,
                                       uint16_t exp_size)
{
    if ((exp_size > 0) && (p_control_packet->data_len != exp_size))
    {
        return NULL;
    }

    uint16_t lpn_addr = packet_mesh_trs_control_friend_clear_lpn_address_get(p_control_packet->p_data);

    for (uint32_t i = 0; i < FRIEND_RECENT_LPNS_LIST_COUNT; i++)
    {
        if (m_friend.recent_lpns[i].last_lpn == lpn_addr)
        {
            return &m_friend.recent_lpns[i];
        }
    }

    return NULL;
}

static friendship_t * friendship_get(const transport_control_packet_t * p_control_packet,
                                     uint16_t exp_size)
{
    if (!m_friend.enabled || ((exp_size > 0) && (p_control_packet->data_len != exp_size)))
    {
        return NULL;
    }

    uint16_t lpn_address = p_control_packet->src;
    if (p_control_packet->opcode == TRANSPORT_CONTROL_OPCODE_FRIEND_CLEAR ||
        p_control_packet->opcode == TRANSPORT_CONTROL_OPCODE_FRIEND_CLEAR_CONFIRM)
    {
        lpn_address = packet_mesh_trs_control_friend_clear_lpn_address_get(
            p_control_packet->p_data);
        __LOG(LOG_SRC_FRIEND, LOG_LEVEL_DBG1, "Clearing friendship for LPN 0x%04x\n",
              lpn_address);
    }

    friendship_t * p_friendship = friendship_find(lpn_address);
    if (p_friendship == NULL)
    {
        __LOG(LOG_SRC_FRIEND, LOG_LEVEL_DBG1, "Received opcode %d from unkown LPN 0x%04x (src 0x%04x)\n",
            p_control_packet->opcode, lpn_address, p_control_packet->src);
    }

    return p_friendship;
}

/*******************************************************************************
 * Transport opcode handler callbacks
 *******************************************************************************/

static void friend_poll_handle(const transport_control_packet_t * p_control_packet,
                               const nrf_mesh_rx_metadata_t * p_rx_metadata)
{
    friendship_t * p_friendship = friendship_get(p_control_packet,
        PACKET_MESH_TRS_CONTROL_FRIEND_POLL_SIZE);
    if (p_friendship == NULL ||
        (p_control_packet->p_data->pdu[PACKET_MESH_TRS_CONTROL_FRIEND_POLL_FSN_OFFSET] &
         PACKET_MESH_TRS_CONTROL_FRIEND_POLL_FSN_MASK_INV) != 0)
    {
        return;
    }

    uint8_t fsn = packet_mesh_trs_control_friend_poll_fsn_get(p_control_packet->p_data);
    __LOG(LOG_SRC_FRIEND, LOG_LEVEL_DBG1,
          "Friend poll (0x%04x): fsn: %u (prev: %u)\n",
          p_friendship->friendship.lpn.src, fsn, p_friendship->fsn);

