NordicSemiconductor/nRF5-SDK-for-Mesh/mesh/friend/src/friend.c
    rssi_update(p_friendship, p_rx_metadata);
    switch (p_friendship->state)
    {
        case FRIEND_STATE_OFFERING:
        {
            uint16_t unicast_address;
            uint16_t dummy_count;
            nrf_mesh_unicast_address_get(&unicast_address, &dummy_count);

            p_friendship->fsn = fsn;
            p_friendship->state = FRIEND_STATE_ESTABLISHED;
            friend_update_tx(p_friendship, p_rx_metadata);
            if (p_friendship->friendship.lpn.prev_friend_src != NRF_MESH_ADDR_UNASSIGNED &&
                p_friendship->friendship.lpn.prev_friend_src != unicast_address)
            {
                repeat_count_set(p_friendship);
                friend_clear_tx(p_friendship);
                friend_clear_timeout_schedule(p_friendship);
            }
            __LOG(LOG_SRC_FRIEND, LOG_LEVEL_DBG1, "Friendship established (0x%04x)\n",
                  p_friendship->friendship.lpn.src);

            confirm_timer_clear(p_friendship->friendship.lpn.src);

            nrf_mesh_evt_t evt;
            evt.type = NRF_MESH_EVT_FRIENDSHIP_ESTABLISHED;
            evt.params.friendship_established.role = NRF_MESH_FRIENDSHIP_ROLE_FRIEND;
            evt.params.friendship_established.lpn_src = p_friendship->friendship.lpn.src;
            evt.params.friendship_established.friend_src = unicast_address;
            event_handle(&evt);
            break;
        }
        case FRIEND_STATE_ESTABLISHED:
        {
            if (p_friendship->fsn != fsn)
            {
                friend_queue_packet_release(&p_friendship->queue);
            }
            p_friendship->fsn = fsn;

            const friend_packet_t * p_packet = friend_queue_packet_get(&p_friendship->queue);
            if (p_packet == NULL)
            {
                friend_update_tx(p_friendship, p_rx_metadata);
            }
            else
            {
                friend_relay(p_friendship, p_packet, p_rx_metadata);
            }
            break;
        }
        default:
            NRF_MESH_ASSERT_DEBUG(false);
            break;
    }

    poll_timeout_schedule(p_friendship,
                          (p_rx_metadata->params.scanner.timestamp +
                           MS_TO_US(p_friendship->friendship.poll_timeout_ms)));
}

static void friend_request_handle(const transport_control_packet_t * p_control_packet,
                                  const nrf_mesh_rx_metadata_t * p_rx_metadata)
{
    NRF_MESH_ASSERT_DEBUG(p_control_packet != NULL);
    NRF_MESH_ASSERT_DEBUG(p_rx_metadata != NULL);
    if (!m_friend.enabled ||
        p_control_packet->data_len != PACKET_MESH_TRS_CONTROL_FRIEND_REQUEST_SIZE)
    {
        return;
    }

    friendship_t * p_friendship = NULL;
    uint32_t status = friendship_alloc(&p_friendship, p_control_packet);
    if (status != NRF_SUCCESS)
    {
        __LOG(LOG_SRC_FRIEND, LOG_LEVEL_WARN, "Error %u: Not able to allocate friendship\n", status);
        return;
    }
    NRF_MESH_ASSERT_DEBUG(p_friendship != NULL);
    p_friendship->friendship.avg_rssi = p_rx_metadata->params.scanner.rssi;

    nrf_mesh_evt_t evt;
    evt.type = NRF_MESH_EVT_FRIEND_REQUEST;
    evt.params.friend_request.p_friendship = &p_friendship->friendship;
    evt.params.friend_request.p_net = p_control_packet->p_net_secmat;
    evt.params.friend_request.p_metadata = p_rx_metadata;
    event_handle(&evt);

    /* NOTE: At this point, the application may have called mesh_friend_friendship_terminate()
     * so we need to check if we're still in a friendship or not.
     */
    if (!friendship_is_active(p_friendship))
    {
        __LOG(LOG_SRC_FRIEND, LOG_LEVEL_DBG1, "Application cancelled friend request\n");
        NRF_MESH_ASSERT_DEBUG(p_friendship->state == FRIEND_STATE_IDLE);

        /* Ensure that the secmat has been removed from DSM. */
        const nrf_mesh_network_secmat_t * p_secmat;
        nrf_mesh_friendship_secmat_get(p_control_packet->src, &p_secmat);
        NRF_MESH_ASSERT_DEBUG(p_secmat == NULL);

        return;
    }

    packet_mesh_trs_control_packet_t friend_offer_pdu;
    memset(&friend_offer_pdu, 0, PACKET_MESH_TRS_CONTROL_FRIEND_OFFER_SIZE);
    packet_mesh_trs_control_friend_offer_receive_window_set(
        &friend_offer_pdu, p_friendship->friendship.receive_window_ms);

    packet_mesh_trs_control_friend_offer_queue_size_set(
        &friend_offer_pdu, MESH_FRIEND_QUEUE_SIZE);

    packet_mesh_trs_control_friend_offer_subscription_list_size_set(
        &friend_offer_pdu, MESH_FRIEND_SUBLIST_SIZE);

    packet_mesh_trs_control_friend_offer_rssi_set(
        &friend_offer_pdu, p_rx_metadata->params.scanner.rssi);

    packet_mesh_trs_control_friend_offer_friend_counter_set(
        &friend_offer_pdu, m_friend.friend_counter++);

    mesh_friendship_receive_window_factor_t receive_window_factor =
        (mesh_friendship_receive_window_factor_t)
        packet_mesh_trs_control_friend_request_receive_window_factor_get(p_control_packet->p_data);
    mesh_friendship_rssi_factor_t rssi_factor =
        (mesh_friendship_rssi_factor_t)
        packet_mesh_trs_control_friend_request_rssi_factor_get(p_control_packet->p_data);

    uint32_t offer_delay_ms =
        friend_offer_delay_get(receive_window_factor,
                               rssi_factor,
                               p_friendship->friendship.receive_window_ms,
                               p_rx_metadata->params.scanner.rssi);

    __LOG(LOG_SRC_FRIEND, LOG_LEVEL_DBG1, "Friend request (0x%04x): "
          "offer delay: %u, rDelay: %u, pTimeout: %u, prevAddr: 0x%04x, elements: %u\n",
          p_friendship->friendship.lpn.src,
          offer_delay_ms,
          p_friendship->friendship.receive_delay_ms,
          p_friendship->friendship.poll_timeout_ms,
          p_friendship->friendship.lpn.prev_friend_src,
          p_friendship->friendship.lpn.element_count);
    __LOG(LOG_SRC_FRIEND, LOG_LEVEL_DBG1, "Friend offer: "
          "rWindow: %u, queueSize: %u, sublistSize: %u, rssi: %d, fcnt: %u\n",
          p_friendship->friendship.receive_window_ms,
          MESH_FRIEND_QUEUE_SIZE,
          MESH_FRIEND_SUBLIST_SIZE,
          p_rx_metadata->params.scanner.rssi,
          m_friend.friend_counter - 1);

    friend_tx(p_friendship,
              TRANSPORT_CONTROL_OPCODE_FRIEND_OFFER,
              &friend_offer_pdu,
              PACKET_MESH_TRS_CONTROL_FRIEND_OFFER_SIZE,
              p_control_packet->p_net_secmat,
              (p_rx_metadata->params.scanner.timestamp +
               MS_TO_US(offer_delay_ms)));

    /* If we don't receive a Friend Poll within 1 second after sending the
     * Friend Offer, the establishment has failed. */
    poll_timeout_schedule(p_friendship,
                          (p_rx_metadata->params.scanner.timestamp +
                           MS_TO_US(FRIEND_OFFER_TIMEOUT_MS + offer_delay_ms)));
}

