NordicSemiconductor/nRF5-SDK-for-Mesh/mesh/friend/src/friend.c
static void friend_clear_handle(const transport_control_packet_t * p_control_packet,
                                const nrf_mesh_rx_metadata_t * p_rx_metadata)
{
    uint16_t friend_req_count = 0;
    uint16_t lpn_counter = 0;

    if (p_control_packet->data_len != PACKET_MESH_TRS_CONTROL_FRIEND_CLEAR_SIZE)
    {
        return;
    }

    lpn_counter = packet_mesh_trs_control_friend_clear_lpn_counter_get(p_control_packet->p_data);

    friendship_t * p_friendship = friendship_get(p_control_packet,
                                                 PACKET_MESH_TRS_CONTROL_FRIEND_CLEAR_SIZE);

    recent_lpns_t * p_recent_lpn  = recent_lpns_get(p_control_packet,
                                                    PACKET_MESH_TRS_CONTROL_FRIEND_CLEAR_SIZE);

    /* Handle corner case that can occur during establishment process: `p_friendship` and
     * `p_recent_lpn` are both valid. If this happens, the friend will allow establishment
     * to continue without terminating (otherwise this will cause wasted effort for LPN).*/
    if ((p_friendship != NULL && p_recent_lpn != NULL) ||
        (p_friendship == NULL && p_recent_lpn == NULL))
    {
        return;
    }

    if (p_friendship != NULL)
    {
        friend_req_count = p_friendship->friendship.lpn.request_count;
    }

    if (p_recent_lpn != NULL)
    {
        friend_req_count = p_recent_lpn->last_req_count;
    }

    if (!friend_clear_is_valid_lpn_counter(friend_req_count, lpn_counter))
    {
        __LOG(LOG_SRC_FRIEND, LOG_LEVEL_DBG1, "Invalid LPNCounter: %u != %u\n",
              lpn_counter, friend_req_count);
        return;
    }

    if (p_friendship != NULL)
    {
        friend_clear_confirm_tx(p_friendship->friendship.lpn.src,
                                p_friendship->friendship.lpn.request_count,
                                p_friendship->bearer.token,
                                p_control_packet);
        friendship_terminate(p_friendship, NRF_MESH_EVT_FRIENDSHIP_TERMINATED_REASON_NEW_FRIEND);

    }

    if (p_recent_lpn != NULL)
    {
        friend_clear_confirm_tx(p_recent_lpn->last_lpn,
                                p_recent_lpn->last_req_count,
                                p_recent_lpn->token,
                                p_control_packet);
    }
}

static void friend_clear_confirm_handle(const transport_control_packet_t * p_control_packet,
                                        const nrf_mesh_rx_metadata_t * p_rx_metadata)
{
    friendship_t * p_friendship = friendship_get(p_control_packet,
        PACKET_MESH_TRS_CONTROL_FRIEND_CLEAR_CONFIRM_SIZE);
    if (p_friendship == NULL)
    {
        return;
    }

    uint16_t lpn_counter = packet_mesh_trs_control_friend_clear_confirm_lpn_counter_get(
        p_control_packet->p_data);
    if (p_friendship->friendship.lpn.request_count != lpn_counter)
    {
        __LOG(LOG_SRC_FRIEND, LOG_LEVEL_DBG1, "Unexpected LPNCounter: %u != %u\n",
              lpn_counter, p_friendship->friendship.lpn.request_count);
        return;
    }

    timer_sch_abort(&p_friendship->clear_repeat_timer);
}

static void friend_sublist_add_handle(const transport_control_packet_t * p_control_packet,
                                      const nrf_mesh_rx_metadata_t * p_rx_metadata)
{
    friendship_t * p_friendship = friendship_get(p_control_packet, 0);
    if (p_friendship == NULL)
    {
        return;
    }

    uint8_t transaction_number =
        packet_mesh_trs_control_friend_sublist_add_remove_transaction_number_get(
            p_control_packet->p_data);

    uint32_t status = NRF_SUCCESS;
    const uint32_t address_count = sublist_address_count_get(p_control_packet);

    /* NOTE: There is no NACK support for an LPN "misbehaving", i.e., adding
     * more addresses than the subscription list can hold. */
    for (uint32_t i = 0;
         i < address_count && status == NRF_SUCCESS;
         ++i)
    {
        uint16_t address =
            packet_mesh_trs_control_friend_sublist_add_remove_address_list_get(
                p_control_packet->p_data, i);
        status = friend_sublist_add(&p_friendship->sublist, address);
        __LOG(LOG_SRC_FRIEND, LOG_LEVEL_DBG1, "Add sublist addr 0x%04x: %u\n", address, status);
    }

    if (status != NRF_SUCCESS)
    {
        __LOG(LOG_SRC_FRIEND, LOG_LEVEL_WARN, "Error %u: adding to sublist 0x%04x\n",
              status, p_friendship->friendship.lpn.src);
    }
    else
    {
        friend_sublist_confirm_tx(p_friendship, transaction_number, p_rx_metadata);
    }

    poll_timeout_schedule(p_friendship,
                          (p_rx_metadata->params.scanner.timestamp +
                           MS_TO_US(p_friendship->friendship.poll_timeout_ms)));
}

static void friend_sublist_remove_handle(const transport_control_packet_t * p_control_packet,
                                         const nrf_mesh_rx_metadata_t * p_rx_metadata)
{
    friendship_t * p_friendship = friendship_get(p_control_packet, 0);
    if (p_friendship == NULL)
    {
        return;
    }

    uint8_t transaction_number =
        packet_mesh_trs_control_friend_sublist_add_remove_transaction_number_get(
            p_control_packet->p_data);

    for (uint32_t i = 0;
         i < sublist_address_count_get(p_control_packet);
         ++i)
    {
        uint16_t address =
            packet_mesh_trs_control_friend_sublist_add_remove_address_list_get(
                p_control_packet->p_data, i);
        uint32_t status = friend_sublist_remove(&p_friendship->sublist, address);
        (void) status;
        __LOG(LOG_SRC_FRIEND, LOG_LEVEL_DBG1, "Remove sublist addr 0x%04x: %u\n", address, status);
    }

    friend_sublist_confirm_tx(p_friendship, transaction_number, p_rx_metadata);
    poll_timeout_schedule(p_friendship,
                          (p_rx_metadata->params.scanner.timestamp +
                           MS_TO_US(p_friendship->friendship.poll_timeout_ms)));
}

static const transport_control_packet_handler_t m_transport_opcode_handlers[] = {
    {TRANSPORT_CONTROL_OPCODE_FRIEND_POLL, friend_poll_handle},
    {TRANSPORT_CONTROL_OPCODE_FRIEND_REQUEST, friend_request_handle},
    {TRANSPORT_CONTROL_OPCODE_FRIEND_CLEAR, friend_clear_handle},
    {TRANSPORT_CONTROL_OPCODE_FRIEND_CLEAR_CONFIRM, friend_clear_confirm_handle},
    {TRANSPORT_CONTROL_OPCODE_FRIEND_SUBSCRIPTION_LIST_ADD, friend_sublist_add_handle},
    {TRANSPORT_CONTROL_OPCODE_FRIEND_SUBSCRIPTION_LIST_REMOVE, friend_sublist_remove_handle}};

