NordicSemiconductor/nRF5-SDK-for-Mesh/mesh/friend/src/friend.c
static void friend_update_enqueue(friendship_t * p_friendship)
{
    NRF_MESH_ASSERT_DEBUG(m_friend.enabled);

    uint16_t unicast_address;
    uint16_t element_count;
    nrf_mesh_unicast_address_get(&unicast_address, &element_count);

    const nrf_mesh_network_secmat_t * p_secmat = NULL;
    nrf_mesh_friendship_secmat_get(p_friendship->friendship.lpn.src, &p_secmat);
    NRF_MESH_ASSERT_DEBUG(p_secmat != NULL);

    transport_packet_metadata_t trs_metadata = {
        .segmented = false,
        .receivers = TRANSPORT_PACKET_RECEIVER_FRIEND,
        .mic_size = PACKET_MESH_TRS_TRANSMIC_CONTROL_SIZE,
        .type.control.opcode = TRANSPORT_CONTROL_OPCODE_FRIEND_UPDATE,
        .net = {
            .control_packet = true,
            .dst = {
                .value = p_friendship->friendship.lpn.src,
                .type = NRF_MESH_ADDRESS_TYPE_UNICAST
            },
            .src = unicast_address,
            .p_security_material = p_secmat,
            .ttl = 0
        },
        .tx_bearer_selector = CORE_TX_BEARER_TYPE_FRIEND,
        .token = p_friendship->bearer.token
    };

    packet_mesh_trs_packet_t friend_update_packet;
    memset(&friend_update_packet, 0, sizeof(packet_mesh_trs_packet_t));
    packet_mesh_trs_control_opcode_set(&friend_update_packet,
                                       TRANSPORT_CONTROL_OPCODE_FRIEND_UPDATE);

    packet_mesh_trs_control_packet_t * p_friend_update =
        (packet_mesh_trs_control_packet_t *) &friend_update_packet.pdu[PACKET_MESH_TRS_UNSEG_PDU_OFFSET];

    memset(p_friend_update, 0, PACKET_MESH_TRS_CONTROL_FRIEND_UPDATE_SIZE);

    packet_mesh_trs_control_friend_update_iv_update_flag_set(
        p_friend_update, (net_state_iv_update_get() == NET_STATE_IV_UPDATE_IN_PROGRESS));
    packet_mesh_trs_control_friend_update_iv_index_set(
        p_friend_update, net_state_beacon_iv_index_get());

    packet_mesh_trs_control_friend_update_key_refresh_flag_set(
        p_friend_update, (nrf_mesh_key_refresh_phase_get(p_secmat)
                         == NRF_MESH_KEY_REFRESH_PHASE_2));

    /* The MD bit must be set when we actually relay the packet. */
    __LOG_XB(LOG_SRC_FRIEND, LOG_LEVEL_DBG1, "Friend Update Queue",
             p_friend_update->pdu,
             PACKET_MESH_TRS_CONTROL_FRIEND_UPDATE_SIZE);
    __INTERNAL_EVENT_PUSH(INTERNAL_EVENT_FRIEND_PACKET_QUEUED, 0, PACKET_MESH_TRS_CONTROL_FRIEND_UPDATE_SIZE, p_friend_update->pdu);
    friend_queue_packet_push(&p_friendship->queue,
                             &friend_update_packet,
                             PACKET_MESH_TRS_CONTROL_FRIEND_UPDATE_SIZE +
                             PACKET_MESH_TRS_UNSEG_PDU_OFFSET,
                             &trs_metadata,
                             CORE_TX_ROLE_ORIGINATOR);
}

static void iv_update_handle(void)
{
    for (uint32_t i = 0; i < MESH_FRIEND_FRIENDSHIP_COUNT; ++i)
    {
        if (m_friend.friends[i].state == FRIEND_STATE_ESTABLISHED)
        {
            friend_update_enqueue(&m_friend.friends[i]);
        }
    }
}

static bool is_subnet_of_friend(const friendship_t * p_friendship,
                                const nrf_mesh_network_secmat_t * p_secmat)
{
    const nrf_mesh_network_secmat_t * p_friend_secmat = NULL;
    nrf_mesh_friendship_secmat_get(p_friendship->friendship.lpn.src, &p_friend_secmat);
    NRF_MESH_ASSERT_DEBUG(p_friend_secmat != NULL);

    const nrf_mesh_network_secmat_t * p_master_secmat = nrf_mesh_net_master_secmat_get(p_friend_secmat);
    NRF_MESH_ASSERT_DEBUG(p_master_secmat != NULL);

    return ((intptr_t) p_master_secmat == (intptr_t) p_secmat);
}

static void key_refresh_handle(const nrf_mesh_evt_key_refresh_notification_t * p_evt)
{
    for (uint32_t i = 0; i < MESH_FRIEND_FRIENDSHIP_COUNT; ++i)
    {
        if (m_friend.friends[i].state != FRIEND_STATE_ESTABLISHED)
        {
            continue;
        }

        if (is_subnet_of_friend(&m_friend.friends[i], nrf_mesh_net_secmat_from_index_get(p_evt->subnet_index)) &&
            p_evt->phase == NRF_MESH_KEY_REFRESH_PHASE_2)
        {
            friend_update_enqueue(&m_friend.friends[i]);
        }
    }
}

static void mesh_evt_cb(const nrf_mesh_evt_t * p_evt)
{
    if (!m_friend.enabled)
    {
        return;
    }

    switch (p_evt->type)
    {
        case NRF_MESH_EVT_IV_UPDATE_NOTIFICATION:
            iv_update_handle();
            break;

        case NRF_MESH_EVT_KEY_REFRESH_NOTIFICATION:
            key_refresh_handle(&p_evt->params.key_refresh);
            break;

        default:
            break;
    }
}

/*****************************************************************************
 * Interface functions
 *****************************************************************************/
uint32_t mesh_friend_init(void)
{
#ifdef UNIT_TEST
    memset(&m_friend, 0, sizeof(m_friend));
#endif
    for (uint32_t i = 0; i < MESH_FRIEND_FRIENDSHIP_COUNT; ++i)
    {
        m_friend.friends[i].state = FRIEND_STATE_IDLE;
        m_friend.friends[i].poll_timeout.p_context = &m_friend.friends[i];
        m_friend.friends[i].poll_timeout.cb = poll_timeout_cb;
        m_friend.friends[i].clear_repeat_timer.p_context = &m_friend.friends[i];
        m_friend.friends[i].clear_repeat_timer.cb = friend_clear_timeout_cb;

        friend_queue_init(&m_friend.friends[i].queue);
        friend_sublist_init(&m_friend.friends[i].sublist);

        core_tx_friend_init(&m_friend.friends[i].bearer,
                            NRF_MESH_FRIEND_TOKEN_BEGIN + i);
    }

    for (uint32_t i = 0; i < FRIEND_RECENT_LPNS_LIST_COUNT; i++)
    {
        m_friend.recent_lpns[i].last_lpn = NRF_MESH_ADDR_UNASSIGNED;
        m_friend.recent_lpns[i].confirm_send_timer.p_context = &m_friend.recent_lpns[i];
        m_friend.recent_lpns[i].confirm_send_timer.cb = confirm_send_timer_cb;
    }

    /* TODO: Handle enabled/disabled state. */
    m_friend.default_receive_window_ms = MESH_FRIEND_RECEIVE_WINDOW_DEFAULT_MS;
    NRF_MESH_ASSERT_DEBUG((transport_control_packet_consumer_add(
                               &m_transport_opcode_handlers[0],
                               ARRAY_SIZE(m_transport_opcode_handlers))
                           == NRF_SUCCESS));

    m_friend.mesh_evt_handler.evt_cb = mesh_evt_cb;
    nrf_mesh_evt_handler_add(&m_friend.mesh_evt_handler);
#if FRIEND_TEST_HOOK
    m_friend.tx_delay_ms = 0;
#endif
    return NRF_SUCCESS;
}

